{
  "experiences": [
    {
      "title": "Student Research Assistant",
      "company": "Texas A&M University",
      "location": "College Station, Texas, USA",
      "startDate": "February 2025",
      "endDate": "September 2025",
      "description": "Developed two full-stack web applications: (1) OLEI, a Ruby on Rails platform for evaluating leadership qualities using surveys, featuring end-to-end implementation of data collection, processing, and interactive 3D tetrahedron-based metric visualization; and (2) Reflection Cycle, a Django and React application guiding users through a five-step reflective framework, with features such as file uploads, structured form inputs, dynamic UI rendering, and integration of the ChatGPT API to generate personalized, context-aware reflection prompts.",
      "technologies": ["Ruby on Rails", "JavaScript", "Django REST Framework", "React.js", "ChatGPT API"]
    },
    {
      "title": "Data Product Engineer",
      "company": "LTIMindtree",
      "location": "Hyderabad, India",
      "startDate": "July 2022",
      "endDate": "December 2023",
      "description": "Developed and automated the installation of various tech stacks using Bash scripts, significantly reducing manual effort by 85% and improving deployment efficiency. Developed a disaster recovery solution by automating the backup and restoration of Elasticsearch and GitLab to and from an S3 bucket, utilizing a combination of Shell and Python scripts to ensure data integrity and quick recovery. Drastically reduced the deployment time of our product (Refract) by approximately 92% utilizing HELM charts instead of traditional YAML-based deployments. Optimized the AI platforms used in our product by creating new, enhanced Docker images, leading to improved performance and efficiency.",
      "technologies": ["Bash", "Python", "Elasticsearch", "Docker", "Kubernetes", "HELM", "AWS S3", "GitLab"]
    },
    {
      "title": "Web Development Intern",
      "company": "Neo Mentors Education Pvt Ltd",
      "location": "Hyderabad, India",
      "startDate": "June 2021",
      "endDate": "August 2021",
      "description": "Developed a full-stack educational website from scratch using JavaScript, HTML, CSS, and Bootstrap, with Node.js and Express for backend routing. Implemented responsive UI and intuitive navigation to streamline access to study materials and live free classes. Utilized Python with Pandas and Matplotlib to analyze user interaction data. Built a recommendation engine to deliver personalized content, improving user engagement and expanding reach.",
      "technologies": ["JavaScript", "HTML", "CSS", "Bootstrap", "Node.js", "Express", "Python", "Pandas", "Matplotlib"]
    }
  ]
}

